In [2]:
import tensorflow 
tensorflow.__version__

'2.18.0'

# 1.Import Necessary Libraries

In [3]:
import numpy as np #used for computing numerical calculations
import pandas as pd#When working with tabular data, such as data stored in spreadsheets or databases,
#pandas is the right tool for you. pandas will help you to explore, clean, and process your data.
#In pandas, a data table is called a DataFrame.

•	You might have your data in .csv files, .excel files or .tsv files or something else. But the goal is the same in all cases. If you want to analyse that data using pandas, the first step will be to read it into a data structure that’s compatible with pandas.

•	Let’s load a .csv data file into pandas. There is a function for it, called read_csv().We will need to locate the directory of the CSV file at first (it’s more efficient to keep the dataset in the same directory as your program).

# 2. Read the dataset

In [4]:
dataset = pd.read_csv("Churn_Modelling.csv")

In [5]:
#To check first five rows of dataset, we have a function call head( ).

#•	This head () function returns the first 5 rows for the object based on position. It 
#is useful for quickly testing if your object has the right type of data in it. 
dataset.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42.0,2.0,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41.0,1.0,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42.0,8.0,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39.0,1.0,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43.0,2.0,125510.82,1,1,1,79084.10,0

In [6]:
dataset.dtypes

RowNumber            int64
CustomerId           int64
Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                float64
Tenure             float64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object

# 3 Data Preprocessing

## 3.1 Checking for null values

handling the missing values n real world data, there are some instances where a particular element is absent because of various reasons, such as, corrupt data, failure to load the information, or incomplete extraction. Handling the missing values is one of the greatest challenges faced by analysts, because making the right decision on how to handle it generates robust data models. Let us look at different ways of imputing the missing values.

1.deleting rows his method commonly used to handle the null values. Here, we either delete a particular row if it has a null value for a particular feature and a particular column if it has more than 70-75% of missing values. This method is advised only when there are enough samples in the data set. One has to make sure that after we have deleted the data, there is no addition of bias. Removing the data will lead to loss of information which will not give the expected results while predicting the output.

2.Replacing With Mean/Median/Mode This strategy can be applied on a feature which has numeric data like the age of a person or the ticket fare. We can calculate the mean, median or mode of the feature and replace it with the missing values. This is an approximation which can add variance to the data set. But the loss of the data can be negated by this method which yields better results compared to removal of rows and columns. Replacing with the above three approximations are a statistical approach of handling the missing values. This method is also called as leaking the data while training. Another way is to approximate it with the deviation of neighbouring values. This works better if the data is linear.

1. After loading it is important to check the complete information of data as it can indication many of the hidden infomation such as null values in a column or a row
2.Check whether any null values are there or not. if it is present then following can be done
    a.deleting the rows
    b.Filling NaN values with mean, median and mode using fillna() method.
We will be using isnull().any() method to see which column has missing values

In [7]:
#returns true that that particular column conatins null vaue
dataset.isnull().any()

RowNumber          False
CustomerId         False
Surname            False
CreditScore        False
Geography           True
Gender              True
Age                 True
Tenure              True
Balance            False
NumOfProducts      False
HasCrCard          False
IsActiveMember     False
EstimatedSalary    False
Exited             False
dtype: bool

In [8]:
#returns  the count of null values present in particular col
dataset.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          1
Gender             2
Age                2
Tenure             1
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [9]:
#•	describe() method computes a summary of statistics like count, mean,
#standard deviation, min, max and quartile values.
dataset.describe()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.00000,1.000000e+04,10000.000000,9998.000000,9999.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,5000.50000,1.569094e+07,650.528800,38.923585,5.012501,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,2886.89568,7.193619e+04,96.653299,10.487753,2.892165,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,1.00000,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,2500.75000,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,5000.50000,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,7500.25000,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,10000.00000,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

# 3.2 Handling missing values

# Handling missing values
1. After loading it is important to check the complete information of data as it can indication many of the hidden infomation such as null values in a column or a row
2.Check whether any null values are there or not. if it is present then following can be done,
 	a.Imputing data using Imputation method in sklearn 
b.Filling NaN values with mean, median and mode using fillna() method.

In [10]:
dataset["Age"].mean() # numerical , mode()[0] categorical, meian - numerical, categorical

38.92358471694339

In [11]:
dataset["Age"].fillna(dataset["Age"].mean(),inplace = True)
dataset["Geography"].fillna(dataset["Geography"].mode()[0],inplace = True)
dataset["Gender"].fillna(dataset["Gender"].mode()[0],inplace = True)
dataset["Tenure"].fillna(dataset["Tenure"].mean(),inplace = True)

C:\Users\Harismitha Eity\AppData\Local\Temp\ipykernel_20700\84968782.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Age"].fillna(dataset["Age"].mean(),inplace = True)
C:\Users\Harismitha Eity\AppData\Local\Temp\ipykernel_20700\84968782.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Geography"].fillna(dataset["Geography"].mode()[0],inplace = True)
C:\Users\Harismitha Eity\AppData\Local\Temp\ipykernel_20700\84968782.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Gender"].fillna(dataset["Gender"].mode()[0],inplace = True)
C:\Users\Harismitha Eity\AppData\Local\Temp\ipykernel_20700\84968782.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Tenure"].fillna(dataset["Tenure"].mean(),inplace = True)

In [12]:
dataset.isnull().any()

RowNumber          False
CustomerId         False
Surname            False
CreditScore        False
Geography          False
Gender             False
Age                False
Tenure             False
Balance            False
NumOfProducts      False
HasCrCard          False
IsActiveMember     False
EstimatedSalary    False
Exited             False
dtype: bool

In [13]:
dataset.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42.0,2.0,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41.0,1.0,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42.0,8.0,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39.0,1.0,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43.0,2.0,125510.82,1,1,1,79084.10,0
5,6,15574012,Chu,645,Spain,Male,44.0,8.0,113755.78,2,1,0,149756.71,1
6,7,15592531,Bartlett,822,France,Male,50.0,7.0,0.00,2,1,1,10062.80,0
7,8,15656148,Obinna,376,Germany,Female,29.0,4.0,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,France,Male,44.0,4.0,142051.07,2,0,1,74940.50,0
9,10,15592389,H?,684,France,Male,27.0,2.0,134603.88,1,1,1,71725.73,0

# 3.3  Splitting Dependent and Independent variables
Activity 6: Splitting the Dataset into Dependent and Independent variable
•	In machine learning, the concept of dependent variable (y) and independent variables(x) is important to understand. Here, Dependent variable is nothing but output in dataset and independent variable is all inputs in the dataset. 
•	With this in mind, we need to split our dataset into the matrix of independent variables and the vector or dependent variable. Mathematically, Vector is defined as a matrix that has just one column.
To read the columns, we will use iloc of pandas (used to fix the indexes for selection) which takes two parameters — [row selection, column selection].
Let’s split our dataset into independent and dependent variables.

In [14]:
X= dataset.iloc[:,3:13]
y = dataset.iloc[:,13:14]

# 3.4 Label encoding and One hot Encoding

Typically, any structured dataset includes multiple columns with combination of numerical as well as categorical variables. A machine can only understand the numbers. It cannot understand the text. That’s essentially the case with Machine Learning algorithms too.We need to convert each text category to numbers in order for the machine to process those using mathematical equations.
How should we handle categorical variables? There are Multiple way to handle, but will see one of it is LabelEncoding. 
•	Label Encoding is a popular encoding technique for handling categorical variables. In this technique, each label is assigned a unique integer based on alphabetical ordering.

one hot encoding----
we have to create an object of the ColumnTransformer class. But before we can do that, we need to understand the constructor signature of the class. The ColumnTransformer constructor takes quite a few arguments, but we’re only interested in two. The first argument is an array called transformers, which is a list of tuples. The array has the following elements in the same order:

name: a name for the column transformer, which will make setting of parameters and searching of the transformer easy.

transformer: here we’re supposed to provide an estimator. We can also just “passthrough” or “drop” if we want. But since we’re encoding the data in this example, we’ll use the OneHotEncoder here. Remember that the estimator you use here needs to support fit and transform.

column(s): the list of columns which you want to be transformed. In this case, we’ll only transform the first column.

The second parameter we’re interested in is the remainder. This will tell the transformer what to do with the other columns in the dataset. By default, only the columns which are transformed will be returned by the transformer. All other columns will be dropped. But we have the option to tell the transformer what to do with the other columns. We can either drop them, pass them through unchanged, or specify another estimator if we want to do some more processing.

In [15]:
X.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42.0,2.0,0.00,1,1,1,101348.88
1,608,Spain,Female,41.0,1.0,83807.86,1,0,1,112542.58
2,502,France,Female,42.0,8.0,159660.80,3,1,0,113931.57
3,699,France,Female,39.0,1.0,0.00,2,0,0,93826.63
4,850,Spain,Female,43.0,2.0,125510.82,1,1,1,79084.10

In [16]:
X["Geography"].mode()[0]

'France'

In [17]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
X["Gender"] = le.fit_transform(X["Gender"])

In [18]:
X.head(10)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,0,42.0,2.0,0.00,1,1,1,101348.88
1,608,Spain,0,41.0,1.0,83807.86,1,0,1,112542.58
2,502,France,0,42.0,8.0,159660.80,3,1,0,113931.57
3,699,France,0,39.0,1.0,0.00,2,0,0,93826.63
4,850,Spain,0,43.0,2.0,125510.82,1,1,1,79084.10
5,645,Spain,1,44.0,8.0,113755.78,2,1,0,149756.71
6,822,France,1,50.0,7.0,0.00,2,1,1,10062.80
7,376,Germany,0,29.0,4.0,115046.74,4,1,0,119346.88
8,501,France,1,44.0,4.0,142051.07,2,0,1,74940.50
9,684,France,1,27.0,2.0,134603.88,1,1,1,71725.73

# One hot encode Geography column

# one hot encoding the geography variable

one hot encoding--applied nominal categorical variables
state    germany  france    spain
germany   1         0        0
france    0         1        0
spain     0         0        1



we need to add more 3-1=2 columns
3+2=5

if the no.of categoried increases ====100 ----100-1=99-----curse of dimensionalty

In [19]:
X = pd.get_dummies(X, columns=["Geography"], drop_first=True).astype(int) # One-Hot Encoding for Geography

In [20]:
X

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_Germany,Geography_Spain
0,619,0,42,2,0,1,1,1,101348,0,0
1,608,0,41,1,83807,1,0,1,112542,0,1
2,502,0,42,8,159660,3,1,0,113931,0,0
3,699,0,39,1,0,2,0,0,93826,0,0
4,850,0,43,2,125510,1,1,1,79084,0,1
...,...,...,...,...,...,...,...,...,...,...,...
9995,771,1,39,5,0,2,1,0,96270,0,0
9996,516,1,35,10,57369,1,1,1,101699,0,0
9997,709,0,36,7,0,1,0,1,42085,0,0
9998,772,1,42,3,75075,2,1,0,92888,1,0
9999,792,0,28,4,130142,1,1,0,38190,0,0

In [21]:
X.head()

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_Germany,Geography_Spain
0,619,0,42,2,0,1,1,1,101348,0,0
1,608,0,41,1,83807,1,0,1,112542,0,1
2,502,0,42,8,159660,3,1,0,113931,0,0
3,699,0,39,1,0,2,0,0,93826,0,0
4,850,0,43,2,125510,1,1,1,79084,0,1

In [22]:
X.shape

(10000, 11)

#it coverts the categorical data in to mumerical integres based on alphabets

#France Spain Germany
#france = 0
#germany = 1
# spain = 2



# encoding 
Gender
Female and male ----we have to encode
encooding--converting categorical to int or flaoting point numbeers
categorical variables---1.nominal cv
                        2.ordinal cv
1.nominal
gender  male nad female


state ap telangana up


2.ordinal

eduaction   salary
btech         3
mtech         2
phd           1

In [23]:
type(X)

pandas.core.frame.DataFrame

In [24]:
y

      Exited
0          1
1          0
2          1
3          0
4          0
...      ...
9995       0
9996       0
9997       1
9998       1
9999       0

[10000 rows x 1 columns]

In [25]:
X.shape

(10000, 11)

In [26]:
y.shape

(10000, 1)

What does .values do in python Pandas?
The values property returns all values in the DataFrame. The return value is a 2-dimensional array with one array for each row

x = dataset.iloc[:,3:13].values
y = dataset.iloc[:,13:14].values

# 3.5 Train test split

After feature encoding is done, our dataset is ready for the exciting machine learning algorithms!
But before we start deciding the algorithm which should be used, it is always advised to split the dataset into 2 or sometimes 3 parts. Machine Learning algorithms, or any algorithm for that matter, has to be first trained on the data distribution available and then validated and tested, before it can be deployed to deal with real-world data.

In [27]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size = 0.2,random_state = 0)
#100000 , 20000, 80000

In [28]:
X_train.shape

(8000, 11)

In [29]:
y_train.shape

(8000, 1)

In [30]:
X_test.shape

(2000, 11)

In [31]:
X_test

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_Germany,Geography_Spain
9394,597,0,35,8,131101,1,1,1,192852,1,0
898,523,0,40,2,102967,1,1,0,128702,0,0
2398,706,0,42,8,95386,1,1,1,75732,0,1
5906,788,1,32,4,112079,1,0,0,89368,0,0
2343,706,1,38,5,163034,2,1,1,135662,1,0
...,...,...,...,...,...,...,...,...,...,...,...
1037,625,0,24,1,0,2,1,1,180969,0,0
2899,586,0,35,7,0,2,1,0,70760,0,0
9549,578,1,36,1,157267,2,1,0,141533,0,1
2740,650,1,34,4,142393,1,1,1,11276,1,0
6690,573,1,30,8,127406,1,1,0,192950,1,0

In [32]:
X_test.head(1)

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_Germany,Geography_Spain
9394,597,0,35,8,131101,1,1,1,192852,1,0

In [33]:
a = [1,2,3,4,5,6,7,8,9,1]
b = [1,0,1,0,1,0,1,0,1,0]

In [34]:
for i in range(5):
  a_train,a_test,b_train,b_test = train_test_split(a,b , test_size = 0.2 , random_state = 256)
  print("with random stae",a_train )

with random stae [3, 4, 5, 9, 1, 2, 8, 1]
with random stae [3, 4, 5, 9, 1, 2, 8, 1]
with random stae [3, 4, 5, 9, 1, 2, 8, 1]
with random stae [3, 4, 5, 9, 1, 2, 8, 1]
with random stae [3, 4, 5, 9, 1, 2, 8, 1]

In [35]:
for i in range(5):
  a_train,a_test,b_train,b_test = train_test_split(a,b , test_size = 0.2 )
  print("without random stae",a_train )

without random stae [1, 6, 7, 9, 5, 4, 8, 1]
without random stae [3, 4, 9, 2, 1, 5, 6, 8]
without random stae [1, 7, 4, 2, 1, 9, 3, 5]
without random stae [9, 1, 1, 3, 4, 7, 2, 5]
without random stae [2, 5, 1, 9, 3, 4, 8, 6]

# 3.6 Feature scaling


Feature scaling is a method used to normalize the range of independent variables or features of data.
Many machine learning algorithms perform better when numerical input features are scaled to a standard range.

There are two types of scaling..They are
1.Standard Scaling: Standardizing a dataset involves rescaling the distribution of values so that the mean of observed values is 0 and the standard deviation is 1.
2. Min-Max Scaling: Min-Max is rescaling of the data from the original range so that all values are within the new range of 0 and 1.
Let us scale our data to improve performance. Create a object sc as instance of the class Standard scalar and fit the same to our data frame

we apply fit_transform to training dataset not to test dataset????

In [40]:
from sklearn.preprocessing import StandardScaler

In [42]:
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [43]:
X_train

array([[ 0.16958176, -1.09168714, -0.46485988, ...,  1.10642907,
        -0.5698444 ,  1.74367544],
       [-2.30455945,  0.91601335,  0.30087333, ..., -0.74865592,
         1.75486502, -0.57350122],
       [-1.19119591, -1.09168714, -0.94344314, ...,  1.48532999,
        -0.5698444 , -0.57350122],
       ...,
       [ 0.9015152 ,  0.91601335, -0.36914323, ...,  1.41231335,
        -0.5698444 , -0.57350122],
       [-0.62420521, -1.09168714, -0.08199328, ...,  0.84432697,
        -0.5698444 ,  1.74367544],
       [-0.28401079, -1.09168714,  0.87517324, ...,  0.32472867,
         1.75486502, -0.57350122]])

In [44]:
X.shape

(10000, 11)

# 4.ANN starts

## 4.1 Import Necessary Libraries

In [ ]:
# 1. Import Necessary Libraries
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense,Input
import pandas as pd

## 4.2 Build the model

In [ ]:
model = Sequential([
    Input(shape=(X_train.shape[1],)),  # Define input shape here
    Dense(11, activation='relu'),  # First hidden layer
    Dense(8, activation='relu'),  # Second hidden layer
    Dense(1, activation='sigmoid')  # Output layer for binary classification
])

## 4.3 Compile the model

In [ ]:
model.compile(optimizer='adam', loss='binary_crossentropy', metrics=['accuracy'])

## 4.4 Fit the model

In [ ]:
model.fit(x_train,y_train,epochs = 100, batch_size = 32)

batch size =32 
data size =x_train=8000
8000/32=250
250 records at a time

# 4.5 Evaluate Model

In [ ]:
ypred = model.predict(x_test)

In [ ]:
ypred = np.where(ypred >0.5 ,1 , 0)

In [ ]:
ypred

In [ ]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test, ypred)

In [ ]:
X.head(1)

In [ ]:
model.predict(sc.transform([[619,0,42.0,2,0.0,1,1,1,101348,0,0]]))

In [ ]:
#Save the model
model.save("ann.keras")

In [ ]:
dataset.head(1)

# 5.Ann with Different Activation Functions & Optimizers

## 5.1. Define Different Activation Functions & Optimizers

In [ ]:
# 2. Define Different Activation Functions & Optimizers
activations = ['relu', 'sigmoid', 'tanh']
optimizers = ['adam', 'sgd', 'rmsprop']

# 5.2 Function to Create ANN Model with Different Activation Functions & Optimizers

In [ ]:
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense, Input

def create_ann(activation='relu', optimizer='adam'):
    model = Sequential([
        Input(shape=(X_train.shape[1],)),  # Define input shape separately
        Dense(11, activation=activation),  # First hidden layer
        Dense(8, activation=activation),  # Second hidden layer
        Dense(1, activation='sigmoid')  # Output layer for binary classification
    ])
    
    model.compile(optimizer=optimizer, loss='binary_crossentropy', metrics=['accuracy'])
    return model

# 5.3. Train & Evaluate Models with Different Configurations

In [ ]:
results = {}

for activation in activations:
    for optimizer in optimizers:
        print(f"Training Model with Activation: {activation}, Optimizer: {optimizer}")

        # Create & Train Model
        model = create_ann(activation, optimizer)
        history = model.fit(X_train, y_train, epochs=20, batch_size=32, verbose=0, validation_data=(X_test, y_test))
        
        # Evaluate Model
        loss, accuracy = model.evaluate(X_test, y_test, verbose=0)
        
        # Store Results
        results[(activation, optimizer)] = {'Loss': loss, 'Accuracy': accuracy}

# 5.4 Convert Results to a DataFrame for Better Visualization

In [ ]:
# 5. Convert Results to a DataFrame for Better Visualization
results_df = pd.DataFrame.from_dict(results, orient='index')
results_df.reset_index(inplace=True)
results_df.columns = ['Activation', 'Optimizer', 'Loss', 'Accuracy']

# Display the Results as an Observation Chart
print("\n🔍 ANN Performance Comparison")
print(results_df)